Revit 2024 API
FabricationServiceButton.ButtonIndex Property
 The button index for this button.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public int ButtonIndex { get; }
Visual Basic
Public ReadOnly Property ButtonIndex As Integer
	Get
Visual C++
public:
property int ButtonIndex {
	int get ();
}
See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace